# Panda Series Manipulation

In [1]:
import numpy as np
import pandas as pd

In [2]:
lables=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={"a":10,'b':20,'c':30}
print("Lables : ",lables)
print("My Data : ",my_data)
print("Dictionary : ",d)

Lables :  ['a', 'b', 'c']
My Data :  [10, 20, 30]
Dictionary :  {'a': 10, 'b': 20, 'c': 30}

In [3]:
pd.Series(data=my_data, index=lables)

a    10
b    20
c    30
dtype: int64

In [4]:
print("\nHolding Numerical Data\n","-"*25,sep="")
print(pd.Series(arr))

Holding Numerical Data
-------------------------
0    10
1    20
2    30
dtype: int32

In [5]:
print("\nHolding Text Lables\n","-"*20,sep="")
print(pd.Series(lables))

Holding Text Lables
--------------------
0    a
1    b
2    c
dtype: object

In [6]:
ser1=pd.Series([1,2,3,4],["CA","OR","CO","AZ"])
ser2=pd.Series([1,2,5,4],["CA","OR","NV","AZ"])

In [7]:
ser1

CA    1
OR    2
CO    3
AZ    4
dtype: int64

In [8]:
ser2

CA    1
OR    2
NV    5
AZ    4
dtype: int64

In [9]:
print("\nIndexing by name of the item/object (string indetifier)\n","-"*56,sep="")
print("Value of CA in Server 1 : ",ser1["CA"])
print("Value of AZ in Server 1 : ",ser1["AZ"])
print("Value of NV in Server 2 : ",ser2["NV"])

Indexing by name of the item/object (string indetifier)
--------------------------------------------------------
Value of CA in Server 1 :  1
Value of AZ in Server 1 :  4
Value of NV in Server 2 :  5

In [10]:
print("\nIndexing by number (positional value in the series)\n","-"*52,sep="")
print("Value of CA in Server 1 : ",ser1[0])
print("Value of AZ in Server 1 : ",ser1[3])
print("Value of NV in Server 2 : ",ser2[2])

Indexing by number (positional value in the series)
----------------------------------------------------
Value of CA in Server 1 :  1
Value of AZ in Server 1 :  4
Value of NV in Server 2 :  5

In [11]:
print("\nIndexing by a range\n","-"*25,sep="")
print("Value for OR, CO, AZ in Server 1 :\n",ser1[1:4],sep="")

Indexing by a range
-------------------------
Value for OR, CO, AZ in Server 1 :
OR    2
CO    3
AZ    4
dtype: int64

In [12]:
ser3=ser1+ser2

In [13]:
print("\nAfter adding the 2 Series, The result look like this\n","-"*52,sep="")
print(ser3)
print("\nPython tries to add values where it finds common index name, and puts NaN where indices are missing\n")

After adding the 2 Series, The result look like this
----------------------------------------------------
AZ    8.0
CA    2.0
CO    NaN
NV    NaN
OR    4.0
dtype: float64

Python tries to add values where it finds common index name, and puts NaN where indices are missing

In [14]:
print("\nThe idea works even for multiplication...\n","-"*45,sep="")
print(ser1*ser2)

The idea works even for multiplication...
---------------------------------------------
AZ    16.0
CA     1.0
CO     NaN
NV     NaN
OR     4.0
dtype: float64

In [15]:
print("\nOr even for combination of mathematical operations !\n","-"*53,sep="")
print(np.exp(ser1)+np.log10(ser2))

Or even for combination of mathematical operations !
-----------------------------------------------------
AZ    55.200210
CA     2.718282
CO          NaN
NV          NaN
OR     7.690086
dtype: float64

In [16]:
from numpy.random import randn as rn
np.random.seed(10) #This line is the reverse of random, all the numbers keep same..(np.random.seed(any number))
my_matrix=rn(5,4)
row_lables=["A","B","C","D","E"]
column_headings=["W","X","Y","Z"]
df=pd.DataFrame(data=my_matrix, index=row_lables, columns=column_headings)
print("\nThe Data Frame looks like\n","-"*25,sep="")
df

The Data Frame looks like
-------------------------

          W         X         Y         Z
A  1.331587  0.715279 -1.545400 -0.008384
B  0.621336 -0.720086  0.265512  0.108549
C  0.004291 -0.174600  0.433026  1.203037
D -0.965066  1.028274  0.228630  0.445138
E -1.136602  0.135137  1.484537 -1.079805

In [17]:
print("\nThe 'X' Column\n","-","-"*25,sep="")
print(df["X"])
print("\nFor select one column, the object is Series")

The 'X' Column
--------------------------
A    0.715279
B   -0.720086
C   -0.174600
D    1.028274
E    0.135137
Name: X, dtype: float64

For select one column, the object is Series

In [18]:
print("\nType of the pair of the columns :",type(df[['X','Z']]))
print("\nSo, for more than one column, the object turn into DataFrame")

Type of the pair of the columns : <class 'pandas.core.frame.DataFrame'>

So, for more than one column, the object turn into DataFrame

In [19]:
print("\nType of the column : ",type(df["X"]),sep="")
print("\nThe 'X' and 'Z' columns indexed by passiing a list\n","-"*55,sep="")
df[['X','Z']]

Type of the column : <class 'pandas.core.series.Series'>

The 'X' and 'Z' columns indexed by passiing a list
-------------------------------------------------------

          X         Z
A  0.715279 -0.008384
B -0.720086  0.108549
C -0.174600  1.203037
D  1.028274  0.445138
E  0.135137 -1.079805

In [20]:
print("\nThe 'X' column accessed by Dot Method (Not Recommended)\n","-"*55,sep="")
print(df.X)

The 'X' column accessed by Dot Method (Not Recommended)
-------------------------------------------------------
A    0.715279
B   -0.720086
C   -0.174600
D    1.028274
E    0.135137
Name: X, dtype: float64

In [21]:
print("\nThe Data Frame\n","-"*45,sep="")
df

The Data Frame
---------------------------------------------

          W         X         Y         Z
A  1.331587  0.715279 -1.545400 -0.008384
B  0.621336 -0.720086  0.265512  0.108549
C  0.004291 -0.174600  0.433026  1.203037
D -0.965066  1.028274  0.228630  0.445138
E -1.136602  0.135137  1.484537 -1.079805

In [22]:
print("\nElement at Row 'B' &  Column 'Y' is : \n",)
print(df.loc['B','Y'])

Element at Row 'B' &  Column 'Y' is :

0.2655115856921195

In [23]:
print("\nSubset Comprising of RowS B & D and Columns W & Y is : ")
df.loc[['B','D'],['W','Y']]

Subset Comprising of RowS B & D and Columns W & Y is :

          W         Y
B  0.621336  0.265512
D -0.965066  0.228630

In [24]:
print("\nThe Data Frame\n","-"*45,sep="")
df

The Data Frame
---------------------------------------------

          W         X         Y         Z
A  1.331587  0.715279 -1.545400 -0.008384
B  0.621336 -0.720086  0.265512  0.108549
C  0.004291 -0.174600  0.433026  1.203037
D -0.965066  1.028274  0.228630  0.445138
E -1.136602  0.135137  1.484537 -1.079805

In [25]:
print("\nBoolean DataFrame(s) where we are checking if the values are greater than 0\n","-"*75,sep="")
df>0

Boolean DataFrame(s) where we are checking if the values are greater than 0
---------------------------------------------------------------------------

       W      X      Y      Z
A   True   True  False  False
B   True  False   True   True
C   True  False   True   True
D  False   True   True   True
E  False   True   True  False

In [26]:
print("\nFor checking the Element at A,B and C \n","-"*38,sep="")
df.loc[['A','B','C']]>0

For checking the Element at A,B and C
--------------------------------------

      W      X      Y      Z
A  True   True  False  False
B  True  False   True   True
C  True  False   True   True

In [27]:
booldf=df>0   #In this case, we can see all numbers greater than 0
print("\nDataFrame indexed by boolean dataframe\n","-"*45,sep="")
df[booldf]

DataFrame indexed by boolean dataframe
---------------------------------------------

          W         X         Y         Z
A  1.331587  0.715279       NaN       NaN
B  0.621336       NaN  0.265512  0.108549
C  0.004291       NaN  0.433026  1.203037
D       NaN  1.028274  0.228630  0.445138
E       NaN  0.135137  1.484537       NaN

In [28]:
matrix_data=np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,162')
row_lable=['A','B','C','D','E']
column_headings=["Age",'Height','Weight']
df=pd.DataFrame(data=matrix_data, index=row_lable, columns=column_headings)
print("\nA New DataFrame\n","-"*25,sep="")
df

A New DataFrame
-------------------------

   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     162

In [29]:
print("\nRows with Height > 65 inch\n","-"*35,sep="")
df[df['Height']>65]

Rows with Height > 65 inch
-----------------------------------

   Age  Height  Weight
A   22      66     140
B   42      70     148
D   35      68     160

In [30]:
booldf1=df['Height']>65
booldf2=df['Weight']>145

In [31]:
print("\nRows with Height > 65 inch & Weight > 145 lbs\n","-"*45,sep="")
df[(booldf1) & (booldf2)]

Rows with Height > 65 inch & Weight > 145 lbs
---------------------------------------------

   Age  Height  Weight
B   42      70     148
D   35      68     160

In [32]:
print("\nDataFrame only with Age & Weight columns whose Height > 65 inch\n","-"*68,sep="")
df[booldf1][["Age","Weight"]]

DataFrame only with Age & Weight columns whose Height > 65 inch
--------------------------------------------------------------------

   Age  Weight
A   22     140
B   42     148
D   35     160

In [33]:
print("\nDataFrame only with Age & Weight columns whose Height > 65 inch\n","-"*68,sep="")
df[df["Height"]>65][["Age","Weight"]]

DataFrame only with Age & Weight columns whose Height > 65 inch
--------------------------------------------------------------------

   Age  Weight
A   22     140
B   42     148
D   35     160

In [34]:
print("\nThe Data Frame\n","-"*45,sep="")
df

The Data Frame
---------------------------------------------

   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     162

In [35]:
print("\nAfter Resetting index\n","-"*35,sep="")
df.reset_index()

After Resetting index
-----------------------------------

  index  Age  Height  Weight
0     A   22      66     140
1     B   42      70     148
2     C   30      62     125
3     D   35      68     160
4     E   25      62     162

In [36]:
print("\nAfter Resetting index with 'drop' option TRUE\n","-"*45,sep="")
df.reset_index(drop=True)

After Resetting index with 'drop' option TRUE
---------------------------------------------

   Age  Height  Weight
0   22      66     140
1   42      70     148
2   30      62     125
3   35      68     160
4   25      62     162

In [37]:
print("\nAdding a new column 'Profession'\n","-"*45,sep="")
df["Profession"]="Student Teacher Engineer Doctor Nurse".split()
df

Adding a new column 'Profession'
---------------------------------------------

   Age  Height  Weight Profession
A   22      66     140    Student
B   42      70     148    Teacher
C   30      62     125   Engineer
D   35      68     160     Doctor
E   25      62     162      Nurse

In [38]:
print("\nSetting 'Profession' column at index\n","-"*45,sep="")
df.set_index("Profession")

Setting 'Profession' column at index
---------------------------------------------

            Age  Height  Weight
Profession
Student      22      66     140
Teacher      42      70     148
Engineer     30      62     125
Doctor       35      68     160
Nurse        25      62     162